#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `failure`

<details><summary>Show Plan</summary>

```

data.cloudflare_zone.zone: Reading...
data.cloudflare_zone.zone: Read complete after 0s [id=2cfd579b89369f6a8e7f2d6f55c1dfca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_list.redirect_pages will be created
  + resource "cloudflare_list" "redirect_pages" {
      + account_id = "8d679dc8356c467df23c2a56c4f2fb2a"
      + id         = (known after apply)
      + kind       = "redirect"
      + name       = "pascaliske_dev_redirects"

      + item {
          + comment = "/about -> /home"

          + value {
              + redirect {
                  + source_url  = "pascaliske.dev/about"
                  + status_code = 301
                  + target_url  = "https://pascaliske.dev/home"
                }
            }
        }
      + item {
          + comment = "/imprint -> /legal-notice"

          + value {
              + redirect {
                  + source_url  = "pascaliske.dev/imprint"
                  + status_code = 301
                  + target_url  = "https://pascaliske.dev/legal-notice"
                }
            }
        }
      + item {
          + comment = "/privacy -> /legal-notice"

          + value {
              + redirect {
                  + source_url  = "pascaliske.dev/privacy"
                  + status_code = 301
                  + target_url  = "https://pascaliske.dev/legal-notice"
                }
            }
        }
    }

  # cloudflare_record.bimi will be created
  + resource "cloudflare_record" "bimi" {
      + allow_overwrite = false
      + content         = "v=BIMI1; l=https://pascaliske.dev/assets/icons/bimi.svg;"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "default._bimi"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.bluesky will be created
  + resource "cloudflare_record" "bluesky" {
      + allow_overwrite = false
      + content         = "did=did:plc:ydh7eh65yxeaewinqv7wcno4"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.dkim will be created
  + resource "cloudflare_record" "dkim" {
      + allow_overwrite = false
      + content         = "v=DKIM1; t=s; n=core; p=MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA4n9QRICzC5NRxRzz3WN/dlbz8pdsPPVCeDG09VG3E17iaW0IEH91DpiD8xIi3tNDONA3SuWlR7fni9YgM3oH4fUuKKhSOfg0SKnXXbwMN1s8kswxtNZjJ7Gk9kZGmr7l2y5dBatEAFvpf25G8UrNQC4m8dUpGnHrBuUd5NK6418j1QDwHS8s2sJce4zFkfx1UYSXLWprASZOKi22C0XMqtXipnK6sKgdo1Zb4Pg7v4suH850B1uPNTyqZg4JMvqfIenYjWtY1HEAMYWPBahXL65kqvxFUt/WUgWnAxrYN3+WuJSN6rMziRIakDZWU2aeqxtFT94lm4MSAc9EYhXOh3dROkpS53/SlEr31M8ONcDC294mLePUx5hil8zsMMLOUUgBnYV6XrpK492ObyjsCoSNa1ksmojL9W5zsfvzZlF3si1eqdzc4EOTfhiWVc1RacOjf1Vhy3yd7AI7KrIVQKrUKi+T3vS8WhB6hP2058WKAsZhmJmbNPVJEwjawljENCSfNEbLgHrkhQHMXUeKPE4eJhD+bLbocYAb4LQAFpZoAKuv5cJyh0lMFMIvexFXXndeA6l9CeTwWdzNLY5Mtx7aSo+hTaD6yFs+8f3ZhjI+BpZfvWySF26+6pBj+kjqd+XPbvBuKCWn4XxTTUbNuhHXhHS189o/IM68p9HpKB8CAwEAAQ=="
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "uberspace._domainkey"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.dmarc will be created
  + resource "cloudflare_record" "dmarc" {
      + allow_overwrite = false
      + content         = "v=DMARC1; p=quarantine; rua=mailto:info@pascaliske.dev"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.google will be created
  + resource "cloudflare_record" "google" {
      + allow_overwrite = false
      + content         = "google-site-verification=v4QX97Fl7wkM4ZCYIOEdsygN1W7nrXXti4XcdroAkB4"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pascaliske.dev"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.have_i_been_pwned will be created
  + resource "cloudflare_record" "have_i_been_pwned" {
      + allow_overwrite = false
      + content         = "have-i-been-pwned-verification=b0e4c6f5e450da787e6b149932d70aa8"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pascaliske.dev"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + content         = "tempel.uberspace.de"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 0
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.mail_lockdown will be created
  + resource "cloudflare_record" "mail_lockdown" {
      + allow_overwrite = false
      + content         = "v=mc1 cfid=pascaliske.dev"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_mailchannels"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.next_ipv4 will be created
  + resource "cloudflare_record" "next_ipv4" {
      + allow_overwrite = false
      + content         = "192.0.2.1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "next"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.next_ipv6 will be created
  + resource "cloudflare_record" "next_ipv6" {
      + allow_overwrite = false
      + content         = "2001:db8::"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "next"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.openpgpkey will be created
  + resource "cloudflare_record" "openpgpkey" {
      + allow_overwrite = false
      + content         = "noop"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "openpgpkey"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.production_ipv4 will be created
  + resource "cloudflare_record" "production_ipv4" {
      + allow_overwrite = false
      + content         = "192.0.2.1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.production_ipv6 will be created
  + resource "cloudflare_record" "production_ipv6" {
      + allow_overwrite = false
      + content         = "2001:db8::"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.production_www_ipv4 will be created
  + resource "cloudflare_record" "production_www_ipv4" {
      + allow_overwrite = false
      + content         = "192.0.2.1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.production_www_ipv6 will be created
  + resource "cloudflare_record" "production_www_ipv6" {
      + allow_overwrite = false
      + content         = "2001:db8::"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + content         = "v=spf1 include:spf.uberspace.de include:relay.mailchannels.net ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pascaliske.dev"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

  # cloudflare_ruleset.redirect_pages will be created
  + resource "cloudflare_ruleset" "redirect_pages" {
      + account_id  = "8d679dc8356c467df23c2a56c4f2fb2a"
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "root"
      + name        = "pascaliske_dev_redirects"
      + phase       = "http_request_redirect"

      + rules {
          + action      = "redirect"
          + description = (known after apply)
          + enabled     = true
          + expression  = "http.request.full_uri in $pascaliske_dev_redirects"
          + id          = (known after apply)
          + ref         = (known after apply)

          + action_parameters {
              + from_list {
                  + key  = "http.request.full_uri"
                  + name = "pascaliske_dev_redirects"
                }
            }
        }
    }

  # cloudflare_zone_settings_override.zone_settings will be created
  + resource "cloudflare_zone_settings_override" "zone_settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "2cfd579b89369f6a8e7f2d6f55c1dfca"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + early_hints                 = "on"
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = "on"
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = "on"
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + replace_insecure_js         = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = "high"
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + speed_brain                 = (known after apply)
          + ssl                         = "strict"
          + ssl_automatic_mode          = (known after apply)
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = "on"
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = "on"
          + zero_rtt                    = (known after apply)

          + aegis (known after apply)

          + minify (known after apply)

          + mobile_redirect (known after apply)

          + nel (known after apply)

          + security_header {
              + enabled            = true
              + include_subdomains = false
              + max_age            = 15780000
              + nosniff            = false
              + preload            = false
            }
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Workflow: `Terraform`*